w4d4/music_inventory/app/views/bands/_band.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
  <li>Band: <%= band.name %></li>
  <li><%= link_to "Albums:  #{band.albums.length}",
                  "/bands/#{band.id}/albums" %>