w4d4/music_inventory/app/views/tracks/index.html.erb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 1]]
---
<% album = Album.find(params[:album_id]) %>