w4d4/music_inventory/app/views/albums/_album.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 1]]
---
  <li>Album: <%= album.name %></li>
  <li><%= link_to "Tracks:  #{album.tracks.length}",
                  "/albums/#{album.id}/tracks" %>