w4d4/music_inventory/app/views/albums/index.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT 1  [["id", 1]]
---
<h1>All Albums by <%= Band.find(params[:band_id]).name %></h1>