w4d4/music_inventory/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
  def index
    @albums = Band.find(params[:band_id]).albums