w4d4/music_inventory/app/controllers/tracks_controller.rb

  def index
    @tracks = Album.find(params[:album_id]).tracks
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 1]]